Управление_торговлей.ПБТ/src/DataProcessors/ОбработкаРецептурныйРасчет/ОбработкаРецептурныйРасчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаРецептурныйРасчет</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеЖир</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСахар</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСОМО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеСВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кислотность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроизводства</name>
    <type>
      <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
    </type>
  </attributes>
  <attributes>
    <name>СухиеВеществаФруктов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставЖир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСОМО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСахар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СоставСВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Жир</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СОМО</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сахар</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаНесколькоТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СоставСВФ</name>
      <comment>Состав сухих веществ фруктов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СВФ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/DataProcessors/ОбработкаРецептурныйРасчет/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт

	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Наименование", "Рецептурный расчет");
	РегистрационныеДанные.Вставить("Версия", "1.0");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Информация", "Рецептурный расчет");
	ТЗКоманды = Новый ТаблицаЗначений;
	ТЗКоманды.Колонки.Добавить("Идентификатор");
	ТЗКоманды.Колонки.Добавить("Представление");
	ТЗКоманды.Колонки.Добавить("Модификатор");
	ТЗКоманды.Колонки.Добавить("ПоказыватьОповещение");
	ТЗКоманды.Колонки.Добавить("Использование");    
	СтрокаКоманды = ТЗКоманды.Добавить();
	СтрокаКоманды.Представление = "Рецептурный расчет";
	СтрокаКоманды.ПоказыватьОповещение = Ложь;
	СтрокаКоманды.Использование = "ОткрытиеФормы";
	СтрокаКоманды.Идентификатор = "Рецептурный расчет";    
	РегистрационныеДанные.Вставить("Команды", ТЗКоманды);    
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПечатьРецепт() Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Номенклатура = Номенклатура;
	ОбластьМакета.Параметры.НомерПартии = СокрЛП(НомерПартии);
	ОбластьМакета.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Для каждого ТекСтрока из Товары Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Строка");
		ОбластьМакета.Параметры.Номенклатура = ТекСтрока.Номенклатура;
		ОбластьМакета.Параметры.КоличествоНаНесколькоТонн = ТекСтрока.КоличествоНаНесколькоТонн;
		ОбластьМакета.Параметры.Количество = ТекСтрока.Количество;
		
		ОбластьМакета.Параметры.СоставЖир = ТекСтрока.СоставЖир;
		ОбластьМакета.Параметры.СоставСОМО = ТекСтрока.СоставСОМО;
		ОбластьМакета.Параметры.СоставСахар = ТекСтрока.СоставСахар;
		ОбластьМакета.Параметры.СоставСВ = ТекСтрока.СоставСВ;
		
		ОбластьМакета.Параметры.Жир = ТекСтрока.Жир;
		ОбластьМакета.Параметры.СОМО = ТекСтрока.СОМО;
		ОбластьМакета.Параметры.Сахар = ТекСтрока.Сахар;
		ОбластьМакета.Параметры.СВ = ТекСтрока.СВ;
		
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаПусто");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаВода");
	ВодаКоличествоНаНесколькоТонн = (1000 - Товары.Итог("Количество"))*Количество / 1000;
	ВодаКоличество = 1000-Товары.Итог("Количество");
	ОбластьМакета.Параметры.КоличествоНаНесколькоТонн = (1000 - Товары.Итог("Количество"))*Количество / 1000;
	ОбластьМакета.Параметры.Количество = ""+Формат(1000-Товары.Итог("Количество"),"ЧДЦ=3")+" кг.";
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Всего");
	ОбластьМакета.Параметры.КоличествоНаНесколькоТонн = Товары.Итог("КоличествоНаНесколькоТонн") + ВодаКоличествоНаНесколькоТонн;
	ОбластьМакета.Параметры.Количество = ""+(Товары.Итог("Количество")+ВодаКоличество)+" кг.";
	
	ОбластьМакета.Параметры.Жир = Товары.Итог("Жир")/100;
	ОбластьМакета.Параметры.СОМО = Товары.Итог("СОМО")/100;
	ОбластьМакета.Параметры.Сахар = Товары.Итог("Сахар")/100;
	ОбластьМакета.Параметры.СВ = Товары.Итог("СВ")/100;
	
	ОбластьМакета.Параметры.СодержаниеЖир = СодержаниеЖир;
	ОбластьМакета.Параметры.СодержаниеСОМО = СодержаниеСОМО;
	ОбластьМакета.Параметры.СодержаниеСахар = СодержаниеСахар;
	ОбластьМакета.Параметры.СодержаниеСВ = СодержаниеСВ;
	ОбластьМакета.Параметры.Кислотность = Кислотность;
	
	ОбластьМакета.Параметры.Дата = Формат(Дата, "ДФ=dd.MM.yyyy");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции
